podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/NV_MKL82Z7.svd.xml
<!--
Devices using this peripheral: 
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "NV_MKL82Z7" ?>
         <name>NV</name>
         <description>Flash configuration field</description>
         <groupName>NV</groupName>
         <prependToName>NV_</prependToName>
         <headerStructName>NV</headerStructName>
         <baseAddress>0x00000400</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0xE</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>8</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>3,2,1,0,7,6,5,4</dimIndex>
               <name>BACKKEY%s</name>
               <description>Backdoor Comparison Key %s</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Backdoor Comparison Key</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPROT3</name>
               <description>Non-volatile P-Flash Protection 1 - Low Register</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PROT</name>
                     <description>P-Flash Region Protect</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPROT2</name>
               <description>Non-volatile P-Flash Protection 1 - High Register</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PROT</name>
                     <description>P-Flash Region Protect</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPROT1</name>
               <description>Non-volatile P-Flash Protection 0 - Low Register</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PROT</name>
                     <description>P-Flash Region Protect</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPROT0</name>
               <description>Non-volatile P-Flash Protection 0 - High Register</description>
               <addressOffset>0xB</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PROT</name>
                     <description>P-Flash Region Protect</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSEC</name>
               <description>Non-volatile Flash Security Register</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>Flash Security</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>10</name>
                           <description>MCU security status is unsecure</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>MCU security status is secure</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSLACC</name>
                     <description>Freescale Failure Analysis Access Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Freescale factory access denied</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Freescale factory access granted</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MEEN</name>
                     <description>no description available</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Mass erase is disabled</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Mass erase is enabled</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEYEN</name>
                     <description>Backdoor Key Security Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Backdoor key access enabled</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Backdoor key access disabled</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FOPT</name>
               <description>Non-volatile Flash Option Register</description>
               <addressOffset>0xD</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x3D</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>LPBOOT</name>
                     <description>no description available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Low-power boot</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Normal boot</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOTPIN_OPT</name>
                     <description>no description available</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Force Boot from ROM if BOOTCFG0 asserted, where BOOTCFG0 is the boot config function which is muxed with NMI pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Boot source configured by FOPT (BOOTSRC_SEL) bits</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMI_DIS</name>
                     <description>no description available</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>NMI interrupts are always blocked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>NMI_b pin/interrupts reset default to enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAST_INIT</name>
                     <description>no description available</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Slower initialization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Fast Initialization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOTSRC_SEL</name>
                     <description>Boot source selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Boot from Flash</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Boot from ROM, configure QSPI0, and enter boot loader mode</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Boot from ROM and enter boot loader mode</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
